Autodesk.Revit.DB.SpatialElement.Recenter
Moves the spatial element to its default location.
Remarks:
The default location is a point where a spatial element is placed when it is created automatically without specifying a point.
The default location of a spatial element is identical to the center of the bounding box if it is located inside the boundary,
otherwise Revit will try to find a point that is guaranteed to be inside the boundary using an internal algorithm.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
The spatial element does not have a valid default location.
Since:
2025.3

Autodesk.Revit.DB.SpatialElement.GetDefaultLocation
Gets the default location of the spatial element.
Remarks:
The default location is a point where a spatial element is placed when it is created automatically without specifying a point.
The default location of a spatial element is identical to the center of the bounding box if it is located inside the boundary,
otherwise Revit will try to find a point that is guaranteed to be inside the boundary using an internal algorithm.
Returns:
The default location of the spatial element.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
The spatial element does not have a valid default location.
Since:
2025.3